[
    {
        "title": "Cardiology",
        "context": "\n\nOur highly skilled cardiologists and healthcare professionals use state-of-the-art equipment and techniques to diagnose and treat various heart conditions. We strive to provide world-class cardiovascular care to our patients by offering comprehensive services, including preventive care, advanced diagnostics, and cutting-edge treatments. We offer heart-related care, including diagnostic imaging, interventional cardiology, thoracic surgery, and various procedures for diagnosing and treating cardiovascular disease.\nIn November 2020, King Faisal Hospital Rwanda acquired a catheterization laboratory. The laboratory is used for several procedures, including; diagnosing and treating certain cardiovascular conditions; carrying out coronary angioplasty (opening narrowed or blocked blood vessels that supply blood to the heart); coronary stenting (placing tube-shaped devices into the coronary arteries that supply blood to the heart to keep them open); as well as other interventions to correct blood flow, repair holes in the heart or locate blockages in blood vessels.\nOur Cardiology services include;\n\nA state-of-the-art catheterization lab to cater to patients requiring invasive, often life-saving treatments.\nA range of non-invasive procedures to help patients with cardiovascular disease.\nA 24-hour cardiac clinic that can meet all of a patient’s needs.\nA heart attack service that is considered the best in the region\nA conveniently available on-call cardiology team to assess patients with heart-related symptoms, including heart attacks.\nAn interdisciplinary team with expertise in assessing and controlling complex cardiovascular processes.\nInternational standards and best practices guarantee the prompt treatment of patients.\n\nOur commitment to patient care and safety is paramount, and we aim to deliver the best possible outcomes for every patient we serve. Whether you are seeking routine care or specialized treatment, we are here to help you achieve optimal heart health. \n\n",
        "doctors": [
            {
                "name": "Dr. Gloria MUKESHIMANA",
                "title": "CARDIOLOGIST"
            }
        ]
    },
    {
        "title": "Dermatology",
        "context": "\n\nWelcome to King Faisal Hospital Rwanda’s Dermatology Services!\nOur dermatology specialists are here to help you and your loved one diagnose and treat all skin conditions. Our team of experts includes dermatologists, nurses, and other support staff, all working together to provide the highest quality care to our patients.\nWe offer a wide range of services, including:\n\nDiagnosis and treatment of skin conditions such as acne, eczema, psoriasis, and rosacea.\nSkin cancer screening and treatment.\nCosmetic dermatology services, including Botox, dermal fillers, and laser treatments for skin rejuvenation and hair removal.\nManagement of chronic skin conditions such as vitiligo, alopecia, and hives.\n\nWe take a patient-centered approach to care, working closely with each patient to develop personalized treatment plans tailored to their needs. We also understand the importance of early diagnosis and treatment for skin conditions, especially those related to other health conditions. That’s why our team uses the latest diagnostic tools and treatment options to provide the best possible outcomes for our patients.\nIf you are struggling with a skin condition or concerned about a suspicious mole or lesion, we invite you to schedule a consultation with our team. We are committed to providing the highest quality care and helping you achieve healthy and beautiful skin.\n\n\n\n \n\n\n",
        "doctors": [
            {
                "name": "Dr. Emmanuel KANIMBA",
                "title": "DERMATOLOGIST"
            }
        ]
    },
    {
        "title": "ENDOCRINOLOGY",
        "context": "\n\n\nThe neurosurgery team at King Faisal Hospital Kigali provides a comprehensive range of services including diagnostic tests and treatments for patients facing all types of neurological conditions. Our team of neurosurgeons specializes in treating trauma and tumors of the head and spine as well as neurovascular surgery. Neurovascular conditions treated at KFHK include but are not limited to cerebrovascular aneurysm clipping, arteriovenous malformation, brain tumors both intra-axial and extra-axial, infections and infestations including brain abscess, Neurocysticercosis (parasitic infection of the central nervous system), hydrocephalus treatment, etc. In addition, congenital conditions affecting the central nervous system are treated. Those include Chiari malformation type 1 and spina bifida (a birth defect that occurs when the spine and spinal cord don’t form properly) King Faisal Hospital Kigali is also the headquarter of Rwanda Neurological Centre, an academically-oriented center of excellence which was founded in 2010. The center aims at providing an environment for training, education, and research in neurosurgery and related fields. In the past 5 years, 16 nurses were trained and received certificates in neurosurgical nursing care. Patients consulted in our outpatient department rounds up to 16805 while patients admitted are 3062. 2535 neurosurgical procedures were conducted only for cranial and spine surgery. The hospital partners with different partners to inform best practices in neurosurgery. Partners include Dalhousie University in Halifax, Canada; Duke University, Harvard, FIENS (Foundation for International Education in Neurological Surgery), Randwood Foundation, etc. The hospital houses a library with the most comprehensive and extensive collections of books on neurosurgery and related fields. Neurology diagnostics. Hologram of the human brain and doctor with stethoscope, panorama\n\n\n",
        "doctors": [
            {
                "name": "Dr. Helen Yifter BITEW",
                "title": "ENDOCRINOLOGIST"
            },
            {
                "name": "Dr. Jacqueline UWERA",
                "title": "JUNIOR CONSULTANT INTERNIST"
            }
        ]
    },
    {
        "title": "Gastroenterology",
        "context": "\n\n\nWe are dedicated to providing high-quality gastroenterology services to our patients. Our team of experienced gastroenterologists is trained to diagnose and treat various digestive system conditions, including gastrointestinal (stomach and intestines) and hepatological (liver, gallbladder, biliary tree, and pancreas) diseases.\nWe offer a comprehensive range of diagnostic tests and procedures, including endoscopy, colonoscopy, and imaging tests, to help diagnose and treat our patient’s conditions. Our state-of-the-art facilities and equipment ensure that our patients receive the highest standard of care possible.\nOur gastroenterology services are complemented by a team of skilled nurses and support staff who work together to provide personalized care to each patient. We are committed to ensuring that our patients receive compassionate, individualized care throughout their treatment.\nIf you are experiencing symptoms related to your digestive system, such as abdominal pain, bloating, or diarrhea, our team of gastroenterologists is here to help. Contact us today to schedule a consultation and learn more about our gastroenterology services at KFHR.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Hanna ABERRA",
                "title": "HEAD OF DEPARTMENT  GASTROENTEROLOGY"
            },
            {
                "name": "Dr. Innocenti Dadamessi",
                "title": "VISITING DOCTOR GASTROENTEROLOGIST"
            }
        ]
    },
    {
        "title": "General Internal Medicine",
        "context": "\n\n\nOur team of internal medicine specialists is dedicated to providing high-quality medical care to our patients. Our general internal medicine services include comprehensive medical evaluations, diagnostic testing, and personalized treatment plans. We work closely with our patients to develop individualized care plans that address their unique needs and concerns. We offer comprehensive medical services in a diverse range of sub-specialties, including:\n\n Nephrology\nCardiology\nDermatology\nOncology\nGastroenterology\nNeuro-Psychiatry\nPsychotherapy\nPulmonology\nHematology\nAdult Intensive Care\n\nOur Internal medicine specialists also conduct follow-ups on patients who have had kidney (renal) transplants, and it is the only medical service in the country that performs artificial cardiac pacemaker implantations and follow-ups. We strive to create a welcoming and comfortable environment for our patients and are dedicated to ensuring that each patient receives the highest standard of care.\nIf you need medical care, our general internal medicine team is here to help. Contact us today to schedule a consultation and learn more about our medical services.\n\n\n",
        "doctors": [
            {
                "name": "Dr. UWERA Jacqueline",
                "title": "CONSULTANT INTERNIST"
            },
            {
                "name": "Dr. Damas DUKUNDANE",
                "title": "HEAD OF DEPARTMENT INTERNAL MEDICINE (ONCOLOGY)"
            },
            {
                "name": "Dr. Steve SHYAKA",
                "title": "HEAD OF SERVICEGENERAL MEDICINE"
            },
            {
                "name": "Dr. Vive RUGIRA",
                "title": "MEDICAL OFFICER"
            },
            {
                "name": "Dr. Zainab INGABIRE",
                "title": "INTERNIST"
            },
            {
                "name": "Dr. Kavabushi Patrick",
                "title": "INTERNIST"
            },
            {
                "name": "Dr. Immaculate KAMBUTSE",
                "title": "INTERNIST"
            },
            {
                "name": "Dr. Mucyo Willy",
                "title": "INTERNIST"
            },
            {
                "name": "Dr. Rene Philibert UWITONZE",
                "title": "SENIOR MEDICAL OFFICER"
            },
            {
                "name": "Dr. Ndivito FAIDA",
                "title": "SENIOR MEDICAL OFFICER"
            },
            {
                "name": "Dr. Seraphin IRADUKUNDA",
                "title": "JUNIOR MEDICAL OFFICER"
            },
            {
                "name": "Dr. Nsengiyumva Joseph",
                "title": "SENIOR MEDICAL OFFICER"
            }
        ]
    },
    {
        "title": "Hematology",
        "context": "\n\nOur team of experienced hematologists is dedicated to providing comprehensive care to patients with hematologic disorders. Hematologic disorders can be complex and require a multidisciplinary approach, which is why we work closely with other specialists to provide comprehensive care to our patients.\nOur Hematology Services offer a range of diagnostic and treatment options for patients with hematologic disorders, including:\n\nBlood Disorders: We provide assessment, diagnosis, and treatment for a wide range of blood disorders, including anemia, hemophilia, and thrombocytopenia. Our team of hematologists is experienced in managing these conditions and is dedicated to providing our patients with the highest quality of care.\nHematologic Malignancies: We provide expert care for patients with hematologic malignancies, such as leukemia, lymphoma, and multiple myeloma. Our hematologists work closely with other specialists, such as oncologists and radiation therapists, to provide comprehensive care to our patients.\nCoagulation Disorders: We provide assessment, diagnosis, and treatment for patients with coagulation disorders, such as deep vein thrombosis and pulmonary embolism. Our team of hematologists is experienced in managing these conditions and is dedicated to providing our patients with the highest quality of care.\n\nWe collaborate with our pathological unit to diagnose and treat hemochromatosis (excessive iron in the body), hemophilia (inability to clot), thalassemia (abnormal production of hemoglobin), and nutritional deficiencies such as iron and Vitamin B12. We also diagnose and manage myeloproliferative neoplasm (blood cancer that occurs when the body makes too many white or red cells or platelets), bone marrow aspirate, and trephine biopsies, along with their assessment.\nWe are committed to providing our patients with the highest quality of care. Our Hematology Services are equipped with the latest technology and staffed with a team of highly skilled hematologists who are dedicated to providing expert care to our patients.\nIf you or a loved one needs hematology services, please get in touch with us to schedule an appointment. Our team is ready to provide the care you need to manage your hematologic disorder and improve your overall health and well-being.\n\n",
        "doctors": [
            {
                "name": "Dr. Sandra HAVYARIMANA",
                "title": "HEAD OF DEPARTMENT CLINICAL PATHOLOGY"
            }
        ]
    },
    {
        "title": "Nephrology",
        "context": "\n\n\nOur nephrology specialists are dedicated to providing high-quality care to patients with kidney-related conditions. Our nephrologists are trained to diagnose and treat various kidney conditions, including end-stage renal disease, kidney transplantation, acute kidney failure, kidney stones, and immunological kidney diseases.\nOur nephrology services include comprehensive medical evaluations, diagnostic testing, and personalized treatment plans. Other services include:\n\nDialysis\nPeritoneal Dialysis\n\nOur kidney dialysis center is fully and adequately equipped with the latest state-of-the-art hemodialysis machines. Patients with chronic renal disease can visit our 24-hour Renal center for either daytime or nighttime dialysis sessions at the Renal Center.\nWe work closely with our patients to develop individualized care plans that address their unique needs and concerns. Our team of nephrologists is supported by a team of skilled nurses and support staff committed to providing compassionate care to each patient. We strive to create a welcoming and comfortable environment for our patients and are dedicated to ensuring that each patient receives the highest standard of care.\nIf you need nephrology care, our specialists are here to help. Contact us today to schedule a consultation and learn more about our nephrology services.\n\n\n",
        "doctors": []
    },
    {
        "title": "Neurology",
        "context": "\nWelcome to King Faisal Hospital Rwanda’s Neurology Services! Our team of experienced neurologists is dedicated to providing high-quality care for patients with various neurological conditions.\nWe offer a comprehensive range of services, including diagnostic evaluations, treatment plans, and ongoing management of neurological disorders. Our team utilizes state-of-the-art technology and advanced treatment methods to ensure the best possible outcomes for our patients. We specialize in diagnosing and treating conditions such as epilepsy, stroke, multiple sclerosis, Parkinson’s disease, and many others. Our neurologists work closely with other specialists, such as neurosurgeons, to ensure a coordinated approach to patient care.\nAt King Faisal Hospital Rwanda, we understand the importance of personalized care. That’s why we take the time to get to know each patient and their unique needs. We are committed to working with you to develop a treatment plan tailored to your specific condition and goals. If you or a loved one is experiencing neurological symptoms, don’t hesitate to contact our Neurology Department. Our team is here to provide the support and care you need to improve your quality of life.\nEEG (Electroencephalography): This non-invasive procedure measures electrical activity in the brain using electrodes placed on the scalp. EEG is indicating for supporting epilepsy diagnosis, classification, treatment and prognosis or for differential diagnosis. Plus, don’t miss our Sleep deprivation EEG sessions available exclusively on Wednesdays!\nENMG (Electroneuromyography): Another valuable service we provide, ENMG evaluates the health of muscles and the nerves controlling them. By recording electrical activity, ENMG helps diagnose conditions like muscle disorders, nerve injuries, and disorders affecting the neuromuscular junction.\n \n📅 Consultation Hours:\nEEG: Monday to Friday mornings from 8 AM to 1 PM.\nSleep EEG: Exclusively on Wednesdays.\nENMG: Thursdays and Fridays from 1 PM to 5 PM, Saturdays from 9 AM to 1 PM.\n📞 To schedule your appointment, visit the Neurology Nursing station with a referred paper from the medical practitioner. Our dedicated team is ready to assist you on your journey to better neurological health!\nDon’t delay, take the first step towards comprehensive care today!\n",
        "doctors": [
            {
                "name": "Dr. Arlene NDAYISENGA",
                "title": "JUNIOR CONSULTANT NEUROLOGIST"
            }
        ]
    },
    {
        "title": "Oncology",
        "context": "\nWe offer a range of cancer care services delivered to international best practice standards. Our variety of cancer care services are provided per international best practice standards, and we hope to set the bar higher for oncology care in Africa. We provide early detection and screening programs, specialized diagnostics, and palliative and rehabilitation programs, among other services.\nOur team of experienced oncologists is trained to diagnose and treat a wide range of cancers, including breast, lung, and colon cancer. Our oncology services include comprehensive cancer evaluations, diagnostic testing, and personalized treatment plans. We provide early detection, screening, and treatment programs, including specialized diagnostics, palliative and rehabilitation programs, radiation therapy, and targeted therapy, to help our patients fight their cancer.\nWe understand that cancer treatment can be a difficult and stressful for our patients and their families. That’s why our oncology specialists are committed to providing compassionate care and support throughout the treatment process. We strive to create a welcoming and comfortable environment for our patients and are dedicated to ensuring that each patient receives the highest standard of care.\nIf you or a loved one has been diagnosed with cancer, our team of oncology specialists at King Faisal Hospital in Rwanda is here to help. Contact us today to schedule a consultation and learn more about our oncology services.\n",
        "doctors": [
            {
                "name": "Dr. Achille MANIRAKIZA",
                "title": "ONCOLOGIST"
            },
            {
                "name": "Dr. Apollo MUGABO",
                "title": "SENIOR RESIDENT, MEDICAL ONCOLOGY"
            },
            {
                "name": "Dr. Damas DUKUNDANE",
                "title": "HEAD OF DEPARTMENT INTERNAL MEDICINE (ONCOLOGY)"
            }
        ]
    },
    {
        "title": "Pulmonology",
        "context": "\n\n\nWe offer top-notch pulmonology services (chest and lung) to our patients. Our highly trained and experienced pulmonologists are dedicated to providing comprehensive care for patients with respiratory disorders. We offer the following services:\n\nConsultation – inpatient and outpatient\nA multidisciplinary approach to ensure excellent patient care and patient safety.\nPulmonary outpatient clinic for diagnosing and treating respiratory diseases, such as asthma, bronchitis, pneumonia, chronic obstructive pulmonary disease (COPD), and lung cancer.\nDiagnostic testing, such as pulmonary function tests, bronchoscopy, and imaging studies, to accurately diagnose and treat pulmonary conditions\nInterventional pulmonology, such as bronchoscopy that involves using a scope to view the airways and lungs, and biopsy procedures to diagnose and treat lung conditions.\nPulmonary rehabilitation programs to improve lung function and quality of life for patients with chronic respiratory diseases.\nManagement of critical care patients in the intensive care unit (ICU), such as those requiring mechanical ventilation or treatment for acute respiratory distress syndrome (ARDS).\nAllergy testing and treatment for conditions such as allergic rhinitis, asthma, and sinusitis.\n\nWe also offer advanced treatment options, including:\n\nMedication Therapy\nOxygen Therapy\nPulmonary Rehabilitation.\n\nWe understand that respiratory disorders can be challenging for patients and their families, and we strive to provide compassionate care and support throughout the treatment process. Our team works closely with other specialists, including thoracic surgeons and oncologists, to coordinate care for patients with complex respiratory conditions.\nIf you or a loved one is struggling with a respiratory condition, our team is here to help. Contact us today to schedule a consultation and learn more about our pulmonology services.\n \n\n\n",
        "doctors": [
            {
                "name": "Dr. SIBOMANA Jean Pierre",
                "title": "CONSULTANT INTERNIST, PULMONOLOGIST"
            }
        ]
    },
    {
        "title": "Rheumatology",
        "context": "\nWelcome to King Faisal Hospital Rwanda’s Rheumatology Services!\nWe are a team of dedicated healthcare professionals who specialize in the diagnosis and treatment of rheumatic diseases. Our team of experts includes rheumatologists, nurses, and other support staff, all working together to provide the highest quality care to our patients.\nWe offer a wide range of services, including:\n       1. Diagnosis and treatment of rheumatic diseases such as rheumatoid arthritis, psoriatic arthritis, lupus, and gout.\n       2. Management of autoimmune disorders.\n      3. Comprehensive treatment plans, which may include medication, physical therapy, and lifestyle modifications.\n      4. Joint injections to alleviate pain and inflammation.\n      5. Infusion therapy for patients requiring intravenous medication.\nWe understand that living with rheumatic disease can be challenging. That’s why we take a patient-centered approach to care, working closely with each patient to develop personalized treatment plans tailored to their needs.\nWe also understand that early diagnosis and treatment are essential for managing rheumatic diseases effectively. That’s why our team uses the latest diagnostic tools and treatment options to provide the best possible outcomes for our patients.\nIf you are struggling with a rheumatic disease, we invite you to schedule a consultation with our team. We are committed to providing the highest quality care and helping you manage your condition so you can live a healthy and fulfilling life.\n\n\n\n\n",
        "doctors": []
    },
    {
        "title": "Cardiac Surgery",
        "context": "\n\nWe offer advanced and comprehensive cardiac surgical services to patients in Rwanda and the surrounding regions. Our team of highly skilled and experienced cardiac surgeons is dedicated to providing our patients with the highest level of care.\n\n\n\nWe specialize in cardiac surgeries, including bypass surgery, valve repair and replacement, and complex congenital heart surgeries. Our state-of-the-art facility has the latest technology and equipment, allowing us to provide precise and effective surgical interventions.\nWe understand cardiac surgery can be a daunting and stressful experience for patients and their families. That’s why we strive to provide a warm and welcoming environment and ensure our patients receive compassionate and individualized care throughout their surgical journey.\nOur experts work closely with patients and their families to develop a comprehensive treatment plan that addresses their unique needs and circumstances. We use the latest surgical techniques and technology to ensure the best possible outcomes for our patients.\nIf you or a loved one need cardiac surgery services, we invite you to visit the Cardiac Surgery unit at King Faisal Hospital Rwanda. Our team is here to provide you with the highest level of care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n\n",
        "doctors": []
    },
    {
        "title": "Cardio-Thoracic Surgery",
        "context": "\n\nOur team of highly skilled and experienced cardiothoracic surgeons is dedicated to providing our patients with the highest level of care. Our state-of-the-art facility has the latest technology and equipment, allowing us to provide precise and effective surgical interventions.\nOur experts work closely with patients and their families to develop a comprehensive treatment plan that addresses their unique needs and circumstances. We use the latest surgical techniques and technology to ensure the best possible outcomes for our patients.\nIf you or a loved one need cardiothoracic surgery services, we invite you to visit the Cardio-Thoracic Surgery department at King Faisal Hospital Rwanda. Our team is here to provide you with the highest level of care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n",
        "doctors": [
            {
                "name": "Dr. Maurice MUSONI",
                "title": "CARDIOTHORACIC SURGEON"
            },
            {
                "name": "DR MAHLET TESFAYE",
                "title": "CARDIOTHORACIC SURGEON"
            },
            {
                "name": "Dr. CILO CAMPANELLA",
                "title": "DIRECTOR OF ADULT CARDIOTHORACIC PROGRAM"
            }
        ]
    },
    {
        "title": "Dental Orthodontics",
        "context": "\n\n\nWe provide comprehensive orthodontic care to help patients achieve healthy, functional, and beautiful smiles. Our highly trained and experienced orthodontists are dedicated to providing personalized care and utilizing the latest techniques and technologies to deliver outstanding results.\nOur orthodontic services include diagnosing, preventing, and treating dental and facial irregularities, such as misaligned teeth, bite problems, and jaw disorders. We offer many orthodontic treatments, including braces, clear aligners, and retainers, to help straighten teeth, improve bite function, and enhance oral health. Other services offered include:\n\nAesthetic dentistry with teeth whitening, porcelain, and composite veneers\nMinor oral surgery, such as wisdom tooth removal,\nTooth extractions,\nSoft tissue injury repair,\nProsthodontics dealing removable partial and complete dentures,\nDental crowns and bridges,\nDental implants placement and restoration,\nPeriodontal therapy dealing with periodontium by keeping healthy gingiva & bone and treating affected ones.\nPreventive, interceptive, and fixed orthodontics, treatments of children with special needs under sedation, and treatments of geriatric patients.\n\nOur surgeons use minimally invasive techniques for most operations, speeding up recovery time and decreasing the risk of infection. Our team of experts also works closely with patients to develop a customized treatment plan that addresses their unique needs and goals. We use the latest techniques and technologies to ensure the best possible outcomes for our patients, including digital imaging and computerized treatment planning.\nIf you or a loved one need orthodontic care, we invite you to visit the Dental Orthodontics unit at King Faisal Hospital Rwanda. Our team is here to provide you with the highest level of care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Madeleine UWAMAHORO",
                "title": "HEAD OF DEPARTMENT ORAL & DENTAL SURGERY"
            }
        ]
    },
    {
        "title": "General Surgery",
        "context": "\n\n\nKing Faisal Hospital Rwanda provides various surgical services to address multiple medical conditions. Our highly skilled and experienced surgeons are dedicated to delivering exceptional care to our patients.\nOur surgical unit offers various general surgery services, including minimally invasive, laparoscopic, and open surgery. We provide surgical treatment for appendicitis, hernias, gallbladder disease, and colorectal disorders. Our surgeons work closely with other medical professionals to ensure our patients receive comprehensive and coordinated care.\nAt the General Surgery unit, we understand that surgery can be a stressful experience for patients and their families. That’s why we strive to create a welcoming, comfortable, and supportive environment for our patients. We are committed to ensuring our patients receive personalized care tailored to their needs and circumstances.\nExcellence is the standard of care for every surgical specialty at our unit. From the top surgeons in the area to our skilled surgical nurses, anesthesiologists and support staff strive to provide the highest-level, patient-centered surgical care available. Our surgical specialists’ is characterized by local and regional’s leading surgeons. Their skill, knowledge, and expertise are equaled only by their compassion in dealing with our surgical patients. Our team of experts uses the latest techniques and technologies to ensure that our patients receive the best possible outcomes from their surgical procedures. We also provide comprehensive pre-and post-operative care to ensure our patients recover quickly and safely.\nIf you or a loved one require surgical treatment, we invite you to visit the General Surgery department at King Faisal Hospital Rwanda. Our team is here to provide you with exceptional care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n\n",
        "doctors": [
            {
                "name": "Dr. KAMBERE Cynthia",
                "title": "SENIOR REGISTRAR"
            },
            {
                "name": "Mr. Manirabona Emmanuel",
                "title": "JUNIOR CONSULTANT GENERAL SURGERY"
            },
            {
                "name": "Dr. Desire RUBANGUKA",
                "title": "HEAD OF SURGICAL SERVICES"
            },
            {
                "name": "Dr. Augustin Limgba",
                "title": "GENERAL SURGEON"
            },
            {
                "name": "Dr. Christian NIYONZIMA",
                "title": "GENERAL SURGEON"
            },
            {
                "name": "Dr. Uwase Clement",
                "title": "JUNIOR CONSULTANT, GENERAL SURGERY"
            },
            {
                "name": "Dr. Norbert NIYONSHUTI",
                "title": "JUNIOR CONSULTANT, GENERAL SURGERY"
            },
            {
                "name": "Dr. Isaie TWAHIRWA",
                "title": "JUNIOR CONSULTANT, GENERAL SURGERY"
            },
            {
                "name": "Dr. Fidele HAVUGIMANA",
                "title": "JUNIOR REGISTRAR"
            },
            {
                "name": "Dr. Ganishuri Dieudonne",
                "title": "JUNIOR REGISTRAR"
            }
        ]
    },
    {
        "title": "Maxillo-Facial Surgery",
        "context": "\n\nWelcome to the Maxillo-Facial Surgery unit at King Faisal Hospital Rwanda, where we specialize in diagnosing and treating conditions affecting the mouth, jaw, face, and neck. Our highly skilled and experienced surgeons are dedicated to providing exceptional care to our patients.\nOur department offers a wide range of Maxillo-Facial Surgery services, including treating facial trauma, oral cancer, cleft lip and palate, facial deformities, and orthognathic surgery. We use the latest techniques and technologies to ensure that our patients receive the best possible outcomes from their procedures.\nAt the Maxillo-Facial Surgery unit, we understand that conditions affecting the mouth, jaw, face, and neck can be physically and emotionally challenging for patients. That’s why we strive to create a welcoming, comfortable, and caring environment where our patients feel supported throughout their treatment journey.\nIf you or a loved one require Maxillo-Facial Surgery services, we invite you to visit the Maxillo-Facial Surgery department at King Faisal Hospital Rwanda. Our team is here to provide you with exceptional care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n\n\n\n\n",
        "doctors": []
    },
    {
        "title": "Neurosurgery",
        "context": "\n\n\nOur Neurosurgery unit provides comprehensive care for patients with conditions affecting the brain, spine, and nervous system. Our highly skilled and experienced neurosurgeons are dedicated to delivering outstanding care and utilizing the latest techniques and technologies to provide the best possible outcomes for our patients. We offer a wide range of Neurosurgery services, including treating brain tumors, spine disorders, cerebrovascular diseases, and traumatic injuries. Some if the conditions we treat include;\n\nCerebrovascular aneurysm clipping.\nArteriovenous malformation.\nBrain tumors, both intra-axial and extra-axial.\nInfections and infestations, including brain abscesses.\nNeurocysticercosis (parasitic infection of the central nervous system).\nHydrocephalus treatment.\nCongenital conditions affecting the central nervous systems, including Chiari malformation type 1 and spina bifida (birth defects that occur when the spine and spinal cord don’t form properly).\n\nWe use advanced diagnostic imaging and surgical techniques, such as minimally invasive and image-guided surgery, to provide our patients with precise and effective treatment.\nKFHR is also the headquarters of Rwanda Neurological Centre, an academically-oriented center of excellence founded in 2010. The center aims to provide an environment for training, education, and research in neurosurgery and related fields. In the past 5 years, 16 nurses were trained and received certificates in neurosurgical nursing care. The hospital partners with different partners to inform best practices in neurosurgery. Partners include Dalhousie University in Halifax, Canada; Duke University; Harvard; FIENS (Foundation for International Education in Neurological Surgery); and Randwood Foundation. The hospital also houses a library with the most comprehensive and extensive collections of books on neurosurgery and related fields.\nAt the Neurosurgery department, we understand that conditions affecting the brain, spine, and nervous system can be complex and challenging. That’s why we strive to create a welcoming, comfortable, and caring environment and ensure our patients receive compassionate and individualized care throughout their treatment journey. Our team of experts works closely with patients to develop a personalized treatment plan that addresses their unique needs and circumstances. We are committed to ensuring that our patients receive comprehensive and coordinated care, from diagnosis to treatment to aftercare.\nIf you or a loved one require Neurosurgery services, we invite you to visit the Neurosurgery department at King Faisal Hospital Rwanda. Our team is here to provide you with exceptional care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Kambere Cynthia",
                "title": "JUNIOR REGISTRAR"
            },
            {
                "name": "Dr. David HAKIZIMANA",
                "title": "NEUROSURGEON"
            }
        ]
    },
    {
        "title": "Orthopedic Surgery & Trauma",
        "context": "\n\nThe orthopedic surgeons at King Faisal Hospital Rwanda provide high-quality health care in treating trauma (fractures), arthroplasty (joint replacement at a large scale), arthroscopy (joint diseases), spine surgery (cross-linking with neurosurgeons for traumatic spine cases and degenerative diseases), pediatric orthopedics, foot and ankle, bone and soft tissue tumor surgery. Most surgeries are minimally invasive and allow quick recovery and rehabilitation for patients. This helps to maintain a short hospital stay of 3 to 4 days.\nWelcome to our Orthopedic Surgery and Trauma Services. We are dedicated to providing the highest quality care for patients with musculoskeletal injuries and conditions. Our team of experienced orthopedic surgeons and specialists is committed to helping patients recover from injuries and return to an active lifestyle.\nOur services include a wide range of orthopedic surgery and trauma treatments, including:\n\n Fracture care: We specialize in diagnosing and treating all types of fractures, including simple and complex fractures of the upper and lower extremities.\nJoint replacement surgery: Our team of orthopedic surgeons are experts in performing joint replacement surgery for hips, knees, and shoulders. We use the latest techniques and technologies to ensure a safe and successful surgery with minimal discomfort and downtime.\nSports injury treatment: We offer comprehensive treatment for sports injuries, including sprains, strains, and tears. We aim to get athletes back to their sport quickly and safely.\nArthroscopic surgery: We perform minimally invasive arthroscopic surgery for various conditions, including joint pain, inflammation, and instability.\nTrauma surgery: Our trauma surgeons are skilled in treating severe musculoskeletal injuries, including fractures, dislocations, and soft tissue injuries.\n\nOur orthopedic surgery and trauma unit provides personalized care to each patient, focusing on patient education and communication. We understand that each patient is unique, and we take the time to listen to their concerns and develop a customized treatment plan tailored to their specific needs.\nOur state-of-the-art facility has the latest technology, allowing us to provide advanced treatments and procedures. We also offer comprehensive rehabilitation services to help patients recover from surgery or injuries. Our physical therapists work closely with our orthopedic surgeons to develop an individualized treatment plan that includes exercises and other therapies to help patients regain strength, mobility, and function.\nIf you are experiencing pain or discomfort in your bones, joints, or muscles, we encourage you to schedule an appointment with our orthopedic surgery and trauma team. We aim to help you achieve optimal musculoskeletal health and get back to doing what you love.\n\n",
        "doctors": [
            {
                "name": "Dr. Emmanuel BUKARA",
                "title": "HEAD OF DEPARTMENTSURGICAL SERVICE"
            },
            {
                "name": "Dr. Ambrose Bayingana RUTARAMA",
                "title": "ORTHOPEDIC SURGEON"
            },
            {
                "name": "Dr. Robert KARAKIRE",
                "title": "ORTHOPEDIC SURGEON"
            },
            {
                "name": "Dr. Kwesiga Stephen",
                "title": "ORTHOPEDIC SURGEON"
            }
        ]
    },
    {
        "title": "Plastic Surgery",
        "context": "\n\n\nWelcome to our Plastic Surgery services. Our team of experienced and board-certified plastic surgeons is committed to providing high-quality and personalized care to our patients. We offer a wide range of plastic surgery procedures to help patients achieve their desired aesthetic goals and reconstructive procedures to help patients who have undergone trauma, cancer treatment, or other medical procedures.\nOur Plastic Surgery services include:\n          1. Cosmetic surgery: We offer a range of cosmetic surgery procedures, including breast augmentation, facelifts, tummy tucks, and liposuction. Our plastic surgeons work closely with each patient to develop a customized treatment plan tailored to their unique needs and desired outcomes.\n        2. Reconstructive surgery: Our plastic surgeons are skilled in performing reconstructive surgeries for patients undergoing trauma, cancer treatment, or other medical procedures. We offer skin grafts and facial reconstructive surgery to help patients regain function and confidence.\n        3. Non-surgical procedures: We also offer a range of non-surgical procedures, including Botox injections, dermal fillers, and laser treatments, to help patients achieve their desired aesthetic goals without undergoing surgery.\nAt King Faisal Hospital Rwanda, we provide personalized care to each patient. Our plastic surgeons work closely with patients to understand their concerns and goals and develop a customized treatment plan tailored to their needs.\nOur state-of-the-art facility is equipped with the latest technology, allowing us to provide advanced treatments and procedures. We are dedicated to providing the highest quality care, and our plastic surgeons work collaboratively with other specialists to ensure the best possible outcomes for our patients.\nIf you are considering plastic or reconstructive surgery, we encourage you to schedule a consultation with our King Faisal Hospital Rwanda team. We aim to help you achieve your desired aesthetic goals and regain confidence.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Francoise MUKAGAJU",
                "title": "PLASTIC SURGEON"
            },
            {
                "name": "Dr. Simba Fidel",
                "title": "JUNIOR REGISTRAR"
            }
        ]
    },
    {
        "title": "Urology",
        "context": "\n\n\nWelcome to the Urology Services at King Faisal Hospital Rwanda. Our team of highly skilled urologists is dedicated to providing comprehensive care for diagnosing, treating, and managing urological conditions.\nOur Urology Services offer a range of diagnostic and treatment options for urological conditions, including:\n\nUrinary Tract Infections: Our urologists diagnose and treat urinary tract infections, including recurrent infections.\nKidney Stones: Our team provides diagnosis, treatment, and management of kidney stones, including surgical options if necessary.\nProstate Health: We provide diagnosis and treatment options for prostate health issues, including prostate cancer, enlarged prostate, and prostatitis.\nBladder Health: Our team offers diagnostic testing and treatment options for bladder health issues, including bladder cancer, overactive bladder, and urinary incontinence.\nErectile Dysfunction: We offer a range of treatment options for erectile dysfunction, including medications, penile injections, and surgical options.\n\nWe are committed to providing our patients with the highest quality of urological care. Our urology team is equipped with the latest technology and staffed with highly skilled professionals dedicated to providing the best care possible.\nIf you or a loved one needs urological care, please contact us to schedule an appointment. Our team is ready to provide the care you need to aid in the diagnosis and treatment of your urological condition.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Tewodros FESSEHA",
                "title": "CONSULTANT, UROLOGIC SURGEON"
            },
            {
                "name": "Dr. Florence Umurangwa NGARAMBE",
                "title": "UROLOGIST"
            },
            {
                "name": "Dr. Edouard NGENDAHAYO",
                "title": "UROLOGIST"
            }
        ]
    },
    {
        "title": "KIDNEY TRANSPLANT",
        "context": "\nOur Kidney Transplant Surgery program is dedicated to providing cutting-edge care and expertise in renal health. Led by a team of highly skilled transplant surgeons, nephrologists, and dedicated healthcare professionals, we offer comprehensive services for patients in need of kidney transplants.\nExpert Care, Personalized Approach\nLed by a team of esteemed surgeons, nephrologists, and compassionate healthcare professionals, our kidney transplant program is committed to delivering exceptional care tailored to each patient’s unique needs. With a focus on excellence and innovation, we ensure the highest surgical expertise and post-operative care standards.\nCutting-Edge Facilities, Optimized Recovery\nOur state-of-the-art facilities are equipped with advanced technology, fostering a safe and conducive environment for kidney transplant surgeries. From pre-transplant evaluations to surgery and recovery, our multidisciplinary team is dedicated to supporting patients every step of the way.\nComprehensive Support, Holistic Wellness\nBeyond medical expertise, we provide holistic support to patients and their families, offering guidance, education, and resources for a successful transplant journey. Our goal is to enhance kidney health and overall quality of life.\nEmbark on Your Journey to Renewed Health\nIf you or a loved one are considering a kidney transplant, we are here to guide you. Contact us today to learn more about our services or schedule a consultation. Your journey to restored kidney health begins with King Faisal Hospital Rwanda.\n \n \n",
        "doctors": []
    },
    {
        "title": "Obstetrics & Gynecology",
        "context": "\n\n\nWelcome to the Obstetrics and Gynecology Services at King Faisal Hospital Rwanda. Our team of experienced obstetricians and gynecologists is dedicated to providing women with the highest quality of care at all stages of life.\nOur services include:\n\nPrenatal care: We provide comprehensive prenatal care to ensure a healthy pregnancy and safe delivery. Our team of obstetricians, midwives, and nurses work together to monitor the health of the mother and fetus, provide education on healthy pregnancy practices, and address any concerns or complications that may arise.\nLabor and delivery: We offer a full range of options, including natural childbirth and cesarean section. Our labor and delivery unit is equipped with state-of-the-art technology and staffed by experienced obstetricians, midwives, and nurses to ensure a safe and comfortable delivery for both mother and baby.\nGynecology services: We offer a full range of gynecology services, including annual exams, pap smears, family planning, and treatment for gynecological conditions such as endometriosis and uterine fibroids.\n Menopause management: Our team of gynecologists can provide personalized care and treatment options for women experiencing menopause, including hormone replacement therapy and lifestyle changes to manage symptoms.\nReproductive health: We provide a wide range of reproductive health services, including infertility diagnosis and treatment, contraception counseling, and preconception counseling for women planning to become pregnant.\n\nWe treat an average of 600 Outpatients and approximately 100 deliveries per month. Our Obstetrics and Gynecology unit recently acquired a high-resolution ultrasound machine that will improve the diagnostic accuracy for fetal anomalies in pregnancy’s first and second trimesters. The new ultrasound machine delivers 3D and 4D imaging formats allowing King Faisal Hospital to stay at the forefront of women’s health imaging, from routine women’s health exams to complex imaging, including fetal echocardiography.\nWe are committed to providing personalized, compassionate care to women throughout their lives. Our team of experienced obstetricians and gynecologists is dedicated to staying up-to-date on the latest research and treatment options to provide the best possible care to our patients.\nIf you are looking for comprehensive, compassionate care for your obstetrics and gynecology needs, we invite you to explore our services and schedule an appointment with one of our skilled providers.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Michael MUGABA",
                "title": "HEAD OF SERVICE OBSTETRICS & GYNECOLOGY"
            },
            {
                "name": "Dr. Jean Paul BYIRINGIRO",
                "title": "OBSTETRICIAN & GYNECOLOGIST"
            },
            {
                "name": "Dr. Rukundo Jean Damascene",
                "title": "OBSTETRICIAN & GYNECOLOGIST"
            },
            {
                "name": "Dr. Balkachew NIGATU",
                "title": "OBSTETRICIAN & GYNECOLOGIST"
            },
            {
                "name": "Dr. Brigitte IRANKUNDA",
                "title": "JUNIOR CONSULTANT, OBSTETRICS & GYNECOLOGY"
            }
        ]
    },
    {
        "title": "Pediatrics",
        "context": "General Pediatric\nWelcome to King Faisal Hospital Rwanda’s General Pediatric Services. We understand that your child’s health and well-being are your top priorities, and we are committed to providing exceptional care to children of all ages. Our certified pediatricians and nurses offer various services to support children’s physical, mental, and emotional health.\nOur services include:\n\nWell-child checkups: We offer routine checkups and developmental assessments to monitor your child’s growth, development, and overall health. Our team provides nutrition, safety, and preventive care guidance to help your child thrive.\nAcute care: We provide care for various acute illnesses and injuries, such as asthma, pneumonia, and injuries from accidents. Our team works to provide prompt and effective treatment to get your child feeling better as soon as possible.\nChronic condition management: We provide specialized care for children with chronic conditions, such as diabetes, asthma, and epilepsy. Our team works with you and your child to develop a personalized care plan to manage their condition and improve their quality of life.\nImmunizations: We offer comprehensive vaccinations to protect your child from preventable illnesses and diseases. Our team guides vaccination schedules and works with you to ensure your child receives the recommended vaccines.\n\nWe understand that children’s healthcare needs are unique and require special care and attention. That’s why our team of medical professionals is committed to providing personalized, family-centered care to every child who walks through our doors. We believe in building solid relationships with our patients and their families and strive to create a welcoming and nurturing environment where children can feel comfortable and safe.\nIf you are looking for a trusted partner in your child’s health and well-being, we encourage you to explore our General Pediatric Services and learn more about how we can support your family’s healthcare needs.\n\nPediatric Cardiology\nWelcome to the Pediatric Cardiology Services at King Faisal Hospital Rwanda. Our team of experienced pediatric cardiologists and specialized nurses is dedicated to providing high-quality care to children with heart conditions.\nOur services include diagnosing and managing congenital and acquired heart diseases in children of all ages. We use the latest technology and techniques to evaluate and treat various conditions, from common heart murmurs to complex congenital heart defects.\nWe provide a comprehensive range of pediatric cardiology services, including:\n\nDiagnosis and Treatment of Congenital Heart Disease: Our team has expertise in diagnosing and managing all types of congenital heart disease, from simple to complex. We use state-of-the-art diagnostic tools such as echocardiography, cardiac catheterization, and MRI to evaluate and diagnose heart conditions.\nEvaluation and Management of Heart Murmurs: Heart murmurs are common in children and can indicate an underlying heart condition. Our team is skilled in evaluating and managing heart murmurs to determine the cause and provide appropriate treatment.\nFetal Echocardiography: We offer fetal echocardiography to evaluate the heart of a fetus during pregnancy. This allows us to detect heart abnormalities early on and plan appropriate care after delivery.\nElectrophysiology Services: Our team evaluates and treats heart rhythm disorders in children, including arrhythmias and syncope.\nInterventional Cardiology: We offer a range of minimally invasive procedures to treat congenital heart defects, such as balloon dilation of narrowed heart valves and the closure of certain types of holes in the heart.\nCardiac Surgery: Our team works closely with the cardiac surgery team to provide comprehensive care for children with complex heart conditions that require surgery.\n\nWe understand that a heart condition diagnosis in your child can be overwhelming. Our team is here to provide compassionate, family-centered care to help your child thrive. We work closely with families to ensure they are involved in every step of their child’s care and provide support and education throughout the process.\nDon’t hesitate to contact us if you have any questions or would like to schedule an appointment. We look forward to serving you and your family.\n\nPediatric Nephrology\nWelcome to the Pediatric Nephrology Services at King Faisal Hospital Rwanda. Our highly trained pediatric nephrologists and specialized nurses are dedicated to providing comprehensive care for children with kidney disorders.\nWe specialize in diagnosing and managing a range of kidney conditions in children, including acute and chronic kidney disease, urinary tract infections, congenital kidney abnormalities, and kidney stones. Our goal is to provide the best possible care for your child while ensuring that their treatment is tailored to their specific needs.\nOur Pediatric Nephrology services include:\n\nDiagnosis and Treatment of Kidney Diseases: Our team uses advanced diagnostic tools to evaluate and diagnose various kidney conditions in children. We work closely with families to develop individualized treatment plans that may include medication, dietary modifications, and other therapies to manage and improve their condition.\nManagement of Chronic Kidney Disease: Our team provides comprehensive care for children with chronic kidney disease, including regular monitoring, medication management, and support services to help manage symptoms and maintain overall health.\nDialysis Services: We offer hemodialysis and peritoneal dialysis services for children with advanced kidney disease. Our specialized nurses and technicians work together to provide personalized care and support to children and their families during this challenging time.\nKidney Transplantation: Our team works closely with transplant surgeons to provide evaluation, preparation, and follow-up care for children requiring kidney transplants.\nUrinary Tract Infection Management: We specialize in managing and preventing urinary tract infections in children. We work with families to provide education on how to prevent infections and manage them effectively when they occur.\n\nWe understand that a diagnosis of a kidney condition in your child can be overwhelming. Our team is here to provide compassionate, family-centered care to help your child thrive. We work closely with families to ensure they are involved in every step of their child’s care and provide support and education throughout the process.\nPlease get in touch with us if you have any questions or would like to schedule an appointment. We look forward to serving you and your family.\n\nPediatric Pulmonology\nWelcome to the Pediatric Pulmonology Services at King Faisal Hospital Rwanda. Our highly trained pediatric pulmonologists and specialized nurses are dedicated to providing comprehensive care for children with lung and respiratory disorders.\nWe specialize in diagnosing and managing a range of respiratory conditions in children, including asthma, bronchitis, pneumonia, cystic fibrosis, and other lung diseases. Our goal is to provide the best possible care for your child while ensuring that their treatment is tailored to their specific needs.\nOur Pediatric Pulmonology services include:\n\nDiagnosis and Treatment of Respiratory Diseases: Our team uses advanced diagnostic tools to evaluate and diagnose a range of respiratory conditions in children. We work closely with families to develop individualized treatment plans that may include medication, breathing exercises, and other therapies to manage and improve their condition.\nAsthma Management: Our team specializes in the management of asthma in children. We provide comprehensive care and support to help children manage their symptoms and reduce the risk of asthma attacks.\nCystic Fibrosis Care: Our team provides specialized care for children with cystic fibrosis, including medication management, nutritional support, and respiratory therapy to help manage their condition and maintain overall health.\nSleep Apnea Management: We specialize in managing sleep apnea in children. Our team works closely with families to provide education and support to help manage symptoms and improve quality of life.\nRespiratory Therapy: We offer a range of respiratory therapies to help children manage their conditions and improve lung function. Our team of specialized therapists works closely with families to develop individualized treatment plans that meet their specific needs.\n\nWe understand that diagnosing a respiratory condition in your child can be overwhelming. Our team is here to provide compassionate, family-centered care to help your child thrive. We work closely with families to ensure they are involved in every step of their child’s care and provide support and education throughout the process.\nPlease contact us if you have any questions or would like to schedule an appointment. We look forward to serving you and your family.",
        "doctors": [
            {
                "name": "Dr.  Jeanne Marie UWURUKUNDO",
                "title": "HEAD OF SERVICEPEDIATRICS"
            },
            {
                "name": "Dr. Tharcisse NGAMBE",
                "title": "HEAD OF QARMPEDIATRICIAN"
            },
            {
                "name": "Dr. John Baptist NKURANGA",
                "title": "HEAD OF MSSDPEDIATRICIAN"
            },
            {
                "name": "Dr. Edgar KALIMBA",
                "title": "PEDIATRICIAN PULMONOLOGIST"
            },
            {
                "name": "Dr. Sabiiti Stephen",
                "title": "JUNIOR CONSULTANT PEDIATRICIAN"
            },
            {
                "name": "Dr. Nkurunziza Jean Nepomuscene",
                "title": "JUNIOR CONSULTANT PEDIATRICIAN"
            }
        ]
    },
    {
        "title": "Neonatology",
        "context": "\n\nWelcome to King Faisal Hospital’s Neonatology Services. We understand that the birth of your baby is a memorable and exciting time, but we also know that it can be a stressful and overwhelming experience, especially if your baby requires specialized medical care. Our certified neonatologists and neonatal nurses are dedicated to providing the highest quality care to premature and sick newborns.\nOur services include:\n\nNeonatal intensive care: Our state-of-the-art neonatal intensive care unit (NICU) provides round-the-clock care for premature and sick newborns who require specialized medical attention. Our team works closely with parents to ensure their babies receive personalized, family-centered care.\nHigh-risk pregnancy management: Our team of obstetricians and neonatologists work together to manage high-risk pregnancies and provide comprehensive care to both mother and baby.\nNeonatal follow-up clinic: Our clinic provides follow-up care and support to premature and sick newborns who have been discharged from the NICU. Our team works with parents to monitor the baby’s growth and development and provide guidance on feeding, developmental milestones, and other concerns.\nParent education and support: We offer educational programs and support groups for parents of premature and sick newborns, including breastfeeding support and guidance on caring for premature babies at home.\nPediatric specialty clinics – We provide specialized care for newborns and infants with specific medical conditions, such as congenital heart disease or respiratory disorders.\nNutrition support – We provide nutritional support and guidance for premature and sick newborns.\n Palliative care – We provide supportive care for infants with life-limiting illnesses and their families.\n\nWe understand that the birth of a baby is a unique and precious time, and we are committed to providing the highest quality care to newborns and their families. Our neonatology team is dedicated to providing personalized, family-centered care to every baby in our NICU.\nIf you are expecting a baby or have a newborn who requires specialized medical care, we encourage you to explore our Neonatology Services and learn more about how we can support you and your baby.\n\n",
        "doctors": [
            {
                "name": "Dr. John Baptist NKURANGA",
                "title": "HEAD OF MSSDPEDIATRICIAN"
            },
            {
                "name": "Dr. Sabiiti Stephen",
                "title": "JUNIOR CONSULTANT PEDIATRICIAN"
            }
        ]
    },
    {
        "title": "Accident & Emergency",
        "context": "\n\n\nWelcome to King Faisal Hospital Rwanda’s Emergency Medicine Services. Our team of emergency physicians and nurses is dedicated to providing high-quality, timely, and compassionate care to patients in their time of need. We understand that medical emergencies can be stressful and unpredictable, which is why we are committed to providing expert care in a calming and supportive environment.\nOur Emergency Medicine Services offer a range of services to meet the diverse needs of our patients. We provide assessment, diagnosis, and treatment for a wide range of conditions, including:\n\nTrauma: Our emergency physicians are experienced in managing traumatic injuries, such as fractures, burns, and head injuries. We work closely with other specialists, such as surgeons and radiologists, to provide comprehensive patient care.\nMedical Emergencies: We provide expert care for patients with medical emergencies, such as heart attacks, strokes, and severe infections. Our emergency physicians are trained to assess and manage these conditions quickly to improve outcomes and save lives.\nPediatrics: Our emergency physicians and nurses are trained to provide specialized care for children and adolescents with medical emergencies. We understand that medical emergencies can be particularly stressful for children and their families, and we are committed to providing compassionate and expert care in a child-friendly environment.\nToxicology: We provide expert care for patients exposed to toxins, such as chemicals or drugs. Our emergency physicians work closely with toxicologists to manage these cases and provide the best possible outcomes for our patients.\n\nWe provide patients access to excellent emergency care, from simple to severe acute illnesses or trauma. The Emergency unit is well set to offer a high standard of care. It comprises of:\n       1. 24/7 care\n       2. Treatment rooms with advanced diagnostic and monitoring equipment\n       3. Private examining rooms\n       4. Resuscitation room\n       5. Procedure room\n       6. Observation room\n       7. Daycare room\nA well-trained on-ground team offers resuscitation and stabilization of sick patients. The team also runs required diagnostic tests to treat acute illnesses adequately. In case of need, our multidisciplinary teams (Internal medicine, cardiology, Surgery, Orthopedics, Pediatrics, Gynecology /Obstetrics, Oncology, Ophthalmology, and ENT) offer consultancy services at the emergency unit. Our emergency services collaborate with the national ambulance medical transport services (SAMU) for patient transfers from district hospitals or directly from the scene of injury or illness through either ground ambulance services or airlifting from anywhere in or out of the country. We also offer basic and advanced cardiac life support training, emergent management of acute traumatic injuries, and other training to future healthcare providers within our scope of practice.\nWe are committed to providing our patients with the highest quality emergency care. Our Emergency Medicine Services are available 24 hours a day, seven days a week, and our team is ready to provide expert care in any medical emergency.\nIf you or a loved one is experiencing a medical emergency, please call our emergency hotline immediately. Our team is ready to provide the care you need when you need it most.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Jean Marie Vianney DUSHIMIYIMANA",
                "title": "HEAD OF DEPARTMENT AMBULATORY CARE"
            },
            {
                "name": "Dr. Lise MUMPOREZE",
                "title": "HEAD OF SERVICE AMBULATORY CARE"
            },
            {
                "name": "Dr. Appolinaire MANIRAFASHA",
                "title": "EMERGENCY PHYSICIAN"
            },
            {
                "name": "Dr. Jean Paul DUSHIME",
                "title": "EMERGENCY PHYSICIAN"
            },
            {
                "name": "Dr. Kamunga  Laurent Gamy",
                "title": "JUNIOR CONSULTANT EMERGENCY MEDICINE"
            }
        ]
    },
    {
        "title": "Anesthesiology",
        "context": "\n\nWelcome to the Anesthesiology Services at King Faisal Hospital Rwanda. Our team of experienced anesthesiologists is dedicated to providing safe and effective anesthesia care for patients undergoing surgery or other medical procedures. Our Anesthesiology Services offer a range of anesthesia options, including general anesthesia, regional anesthesia, and local anesthesia. Our team of anesthesiologist’s works closely with the surgical and medical teams to develop an individualized anesthesia plan for each patient based on their medical history and specific needs.\nOur services include:\n\nPre-Anesthesia Evaluation: Our anesthesiologists thoroughly evaluate each patient before surgery to ensure that anesthesia is administered safely and effectively. This evaluation includes reviewing the patient’s medical history, medications, and potential risk factors.\nIntraoperative Anesthesia Care: Our anesthesiologists are present during surgery to ensure the patient is comfortable and safe. We use advanced monitoring technology to closely monitor the patient’s vital signs and adjust the anesthesia as needed.\nPost-Anesthesia Care: Our team provides expert care to patients recovering from anesthesia to ensure a smooth and comfortable recovery. We closely monitor the patient’s vital signs and provide pain management as needed.\n\nOur Anesthesiology Services are equipped with the latest technology and staffed with a team of highly skilled anesthesiologists who are dedicated to providing the highest quality of care to our patients. If you or a loved one needs anesthesia services, please contact us to schedule an appointment. Our team is ready to provide the necessary care for a safe and comfortable anesthesia experience.\n\n",
        "doctors": [
            {
                "name": "Dr. KWIZERA NDEKEZI Jackson",
                "title": "JUNIOR CONSULTANT ANESTHESIOLOGIST"
            },
            {
                "name": "Dr. Gaston NYIRIGIRA",
                "title": "HEAD OF DEPARTMENT ANESTHESIOLOGY & CRITICAL CARE SERVICE"
            },
            {
                "name": "Dr. Jean Bonaventure UWINEZA",
                "title": "ANESTHESIOLOGIST"
            },
            {
                "name": "Dr. Claude GAKUMBA",
                "title": "ANESTHESIOLOGIST"
            },
            {
                "name": "Dr. Niyobogora Christine",
                "title": "CONSULTANT ANESTHESIOLOGIST"
            },
            {
                "name": "Dr. Protogene TWISUNGANE",
                "title": "ANESTHESIOLOGIST"
            },
            {
                "name": "Dr. Munyaneza Rwibutso Thierry",
                "title": "JNUIOR CONSULTANT ANESTHESIOLOGIST"
            },
            {
                "name": "TUYISHIME HABYARIMANA JEAN DE DIEU",
                "title": "ANESTHESIOLOGIST"
            }
        ]
    },
    {
        "title": "Critical Care (Adults & Pediatrics)",
        "context": "\n\n\nWelcome to King Faisal Hospital Rwanda’s Adult Intensive Care Unit (ICU) services. Our team of experienced and skilled medical professionals is dedicated to providing advanced and specialized care to critically ill patients who require close monitoring and intensive medical attention.\nOur Adult ICU services include:\n\nCritical care management: Our highly trained medical staff is equipped to manage critical illnesses and injuries, such as respiratory failure, sepsis, and heart failure. We use advanced monitoring techniques and technology to closely monitor patients’ conditions and provide prompt and effective medical interventions.\nPost-surgical care: We provide care for patients who have undergone complex surgeries, such as cardiac surgery or neurosurgery, requiring close monitoring and specialized medical attention.\nMultidisciplinary care: Our ICU team works collaboratively with other specialists, including respiratory therapists, pharmacists, and nutritionists, to provide comprehensive and holistic patient care.\nAdvanced technology: Our ICU is equipped with state-of-the-art medical equipment, including ventilators, hemodialysis machines, and advanced cardiac monitoring systems, to provide the best possible care to our patients.\n\nAt King Faisal Hospital Rwanda, we understand that critical illnesses and injuries can overwhelm patients and their families. That’s why we provide compassionate and patient-centered care, ensuring that our patients receive the best possible care and support throughout their stay in our ICU.\nOur team of medical professionals is available 24/7 to provide prompt and adequate medical interventions. We are committed to ensuring the best possible outcomes for our patients and helping them on their journey to recovery.\nIf you or a loved one requires critical or post-surgical care, we encourage you to contact our team to learn more about our Adult ICU services. We are here to support you every step of the way.\n\n\n",
        "doctors": [
            {
                "name": "Dr. SIBOMANA Jean Pierre",
                "title": "SENIOR CONSULTANT CRITICAL CARE, PULMONOLOGIST"
            },
            {
                "name": "Dr. Lise MUMPOREZE",
                "title": "HEAD OF SERVICE AMBULATORY CARE"
            },
            {
                "name": "Dr. Gaston NYIRIGIRA",
                "title": "HEAD OF DEPARTMENT ANESTHESIOLOGY & CRITICAL CARE SERVICE"
            },
            {
                "name": "Dr. Appolinaire MANIRAFASHA",
                "title": "EMERGENCY PHYSICIAN"
            },
            {
                "name": "Dr. Jean Paul DUSHIME",
                "title": "EMERGENCY PHYSICIAN"
            }
        ]
    },
    {
        "title": "Ear, Nose & Throat",
        "context": "\n\n\nWelcome to the Ear, Nose, and Throat (ENT) services at King Faisal Hospital Rwanda, where we provide comprehensive care for patients with ear, nose, and throat conditions. Our highly trained and experienced ENT specialists are dedicated to providing personalized care and utilizing the latest techniques and technologies to deliver outstanding results.\nWe offer a wide range of ENT services, including diagnosing and treating ear infections, hearing loss, sinusitis, allergies, throat disorders, and voice problems. Our state-of-the-art facility has the latest diagnostic equipment, allowing us to provide accurate and precise diagnoses. We use the latest techniques and technologies to ensure the best possible outcomes for our patients, including minimally invasive surgery and hearing aid fittings.\nIf you or a loved one are experiencing ear, nose, or throat symptoms, we invite you to visit the ENT department at King Faisal Hospital Rwanda. Our team is here to provide you with the highest level of care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Twahirwa J. Marie Vianney",
                "title": "JUNIOR CONSULTANT (E.N.T)"
            }
        ]
    },
    {
        "title": "Ophthalmology",
        "context": "\n\nOur Ophthalmology unit provides comprehensive eye care services to patients of all ages. Our highly skilled and experienced ophthalmologists are dedicated to delivering exceptional care and utilizing the latest technologies to provide the best possible outcomes for our patients.\nOur department offers a wide range of Ophthalmology services, including retinal problems associated with diabetes and hypertension, cataract surgery, glaucoma treatment, retinal disorders, and refractive surgery. We use advanced diagnostic equipment and surgical techniques, such as laser-assisted, lid, ocular surface, cataract, and glaucoma surgeries, to provide our patients with precise and effective treatment.\nWe understand that conditions affecting the eyes can significantly impact a person’s quality of life. That’s why we strive to create a welcoming, comfortable, and caring environment and ensure our patients receive compassionate and individualized care throughout their treatment journey. Our team of experts works closely with patients to develop a personalized treatment plan that addresses their unique needs and circumstances. We are committed to ensuring that our patients receive comprehensive and coordinated care, from diagnosis to treatment to aftercare.\nIf you or a loved one require Ophthalmology services, we invite you to visit the Ophthalmology department at King Faisal Hospital Rwanda. Our team is here to provide you with exceptional care and support. Contact us today to schedule a consultation or to learn more about our services.\n\n",
        "doctors": []
    },
    {
        "title": "Laboratory",
        "context": "\n\nWelcome to the Laboratory (Pathology Services) at King Faisal Hospital Rwanda. Our laboratory is staffed by highly skilled pathologists, medical technologists, and laboratory professionals dedicated to providing accurate and timely diagnostic testing services.\nOur Laboratory Services offer a range of diagnostic testing services, including:\n\nHematology: Our hematology services provide diagnostic testing for blood disorders, including anemia, leukemia, and clotting disorders.\nClinical Chemistry: Our clinical chemistry services provide diagnostic testing for various medical conditions, including liver and kidney function, diabetes, and thyroid disorders.\nMicrobiology: Our microbiology services provide diagnostic testing for infectious diseases, including bacterial, viral, and fungal infections.\nImmunology: Our immunology services provide diagnostic testing for immune system disorders, including allergies and autoimmune diseases.\nHistology: Our histology services provide diagnostic testing for tissue samples, including biopsies and surgical specimens.\n\nOur laboratory is equipped with world-class equipment to perform a wide range of pathology tests, which specialized pathologists and senior laboratory scientists with a broad range of expertise in hematopathology, cytopathology, and kidney pathology interpretation.\n\n",
        "doctors": [
            {
                "name": "Dr. Thierry Zawadiz MUVUNYI",
                "title": "DIRECTOR  PATHOLOGY SERVICES"
            },
            {
                "name": "Dr. Sandra HAVYARIMANA",
                "title": "HEAD OF DEPARTMENT CLINICAL PATHOLOGY"
            },
            {
                "name": "Dr. Jean Baptiste MUVUNYI",
                "title": "HEAD OF DEPARTMENT ANATOMIC PATHOLOGY"
            },
            {
                "name": "Dr. Aurore IGIHOZO",
                "title": "PATHOLOGIST"
            },
            {
                "name": "Dr. Habanabakize Thomas",
                "title": "JUNIOR CONSULTANT, ANATOMICAL PATHOLOGIST"
            },
            {
                "name": "Dr. Nyirahabimana Delphine",
                "title": "JUNIOR CONSULTANT, ANATOMICAL PATHOLOGIST"
            }
        ]
    },
    {
        "title": "Pharmacy",
        "context": "\n\n\nWelcome to the Pharmacy Services at King Faisal Hospital Rwanda. Our Pharmacy team is dedicated to providing high-quality and safe medication management to all patients at our hospital. We understand that medication is an essential part of healthcare, and we strive to ensure that our patients receive the proper medication, in the correct dose, at the right time.\nOur Pharmacy Services include:\n\nMedication Dispensing: Our Pharmacy team dispenses a wide range of medications prescribed by our physicians. We ensure that all medications are properly labeled and packaged, and we provide counseling to patients on how to take their medication correctly.\n Medication Management: Our Pharmacy team works closely with physicians, nurses, and other healthcare providers to manage the medication therapy of our patients. We provide drug interaction checks, dose adjustments, and monitoring of adverse drug reactions to ensure the safe and effective use of medications.\nMedication Education: Our Pharmacy team educates patients on their medications, including how to take them, possible side effects, and drug interactions. We work with patients to ensure they understand the importance of taking their medication as prescribed.\nPharmacy Consultations: Our Pharmacists are available to provide consultations to healthcare providers on medication therapy management, drug interactions, and medication dosing for specific patients.\nMedication Safety: We prioritize medication safety and have established procedures to ensure the safe storage, preparation, and dispensing of medications.\n\nAt King Faisal Hospital Rwanda, our Pharmacy team is committed to providing high-quality medication management services to all patients. We work closely with physicians and other healthcare providers to ensure patients receive safe and effective medication therapy. If you have any questions or concerns about your medication, please do not hesitate to ask our Pharmacy team. We are here to help you achieve the best possible health outcomes\n\n\n",
        "doctors": []
    },
    {
        "title": "Imaging & Diagnostic Support",
        "context": "\n\n\nWelcome to the Imaging and Diagnostic Support Services at King Faisal Hospital Rwanda. Our team of highly skilled radiologists and technicians is dedicated to providing advanced imaging and diagnostic services to aid in diagnosing and treating a wide range of medical conditions.\nOur Imaging and Diagnostic Support Services offer a range of diagnostic and imaging services, including:\n\nRadiography: We offer a range of radiography services, including X-rays, CT scans, and MRI scans. Our state-of-the-art equipment and experienced radiologists ensure our patients receive high-quality imaging results.\nUltrasound: Our ultrasound services offer a non-invasive method of diagnosing various medical conditions. We provide various ultrasound services, including obstetric and gynecological, abdominal, and vascular ultrasound.\nMammography: Our mammography services offer advanced screening and diagnostic capabilities for breast cancer. We use the latest technology to provide high-quality mammography services to our patients.\n\nWe have a high-performance, fast, silent, and Digital MRI scanner (1.5 Tesla) which serves patients referred from other healthcare facilities in the region. (Burundi, South Sudan, Tanzania, and DRC). The facility has the only CT scanner with 128 slices capacity in the country, which can perform many complex procedures, including Computed tomographic angiographies (demonstrating the vessels clearly), Virtual Colonoscopies, Bone mineral Densitometry, Virtual Bronchoscopy, CT fluoroscopy to guide interventional procedures, Dynamic studies involving the head, Chest & abdomen other Routine CT scans.\nThe Cathlab (Angio-suite) is the latest addition to the complex equipment. It is used by Both Radiologists & cardiologists in helping patients: with coronary diseases and other vascular diseases in the Head, Abdomen & lower limbs. We use this critical equipment in cancer Treatment by directly injecting Chemotherapy into the vessels that supply liver tumors (chemo-embolization).\nThe imaging & Radiology Department has the most Senior and experienced radiologists involved in Diagnosis, Treatment & Interventional procedures. We look forward to offering Nuclear Medicine, which will offer advanced diagnostic capabilities, including PET, SPECT, and bone scans.\nIf you or a loved one needs imaging or diagnostic services, please contact us to schedule an appointment. Our team is ready to provide the care you need to aid in the diagnosis and treatment of your medical condition.\n\n\n",
        "doctors": [
            {
                "name": "Dr. Cherise Umutoni GAHIZI",
                "title": "JUNIOR CONSULTANT RADIOLOGIST"
            },
            {
                "name": "Dr. Jean Paul RUBONEKA",
                "title": "DIRECTOR OF IMAGING SERVICERADIOLOGY"
            },
            {
                "name": "Dr. Jean Jacques NSHIZIRUNGU",
                "title": "SENIOR RADIOLOGIST"
            },
            {
                "name": "Dr. Patrick NIYONGABO",
                "title": "JUNIOR CONSULTANT RADIOLOGIST"
            }
        ]
    },
    {
        "title": "Mental health",
        "context": "\n\nWelcome to King Faisal Hospital Rwanda’s Clinical Psychology Services. Our team of licensed clinical psychologists is dedicated to providing comprehensive mental health care to our patients. We understand that mental health is a critical component of overall health and well-being, and we are committed to helping our patients achieve their mental health goals.\nOur Clinical Psychology Services offer a range of services to meet the diverse needs of our patients. We provide assessment, diagnosis, and treatment for a wide range of conditions, including:\n\nMood and Anxiety Disorders: We provide therapy for patients with mood and anxiety disorders, such as depression, bipolar disorder, and post-traumatic stress disorder. Our clinical psychologists use evidence-based techniques, such as cognitive-behavioral and mindfulness-based therapy, to help patients manage their symptoms and improve their overall mental health.\nSubstance Use Disorders: We provide therapy for patients with substance use disorders like alcohol or drug addiction. Our clinical psychologists work closely with patients to develop personalized treatment plans to help them achieve sobriety and improve their mental health.\nTrauma and Abuse: We provide therapy for patients who have experienced trauma or abuse, such as physical or sexual assault. Our clinical psychologists use evidence-based techniques, such as eye movement desensitization and reprocessing therapy, to help patients heal from their trauma and improve their overall mental health.\nRelationship Issues: We provide therapy for patients experiencing relationship issues, such as communication problems or conflicts. Our clinical psychologists use evidence-based techniques like couples therapy to help patients improve their relationships and overall mental health.\n\nOur Clinical Psychology Services are an essential part of our healthcare team, and we are proud to offer a range of services to meet the diverse needs of our patients. If you would like to learn more about our Clinical Psychology Services or schedule an appointment, please get in touch with us today. We look forward to serving you and your family.\n\n",
        "doctors": [
            {
                "name": "Dr. Chantal MUREKATETE",
                "title": "PSYCHIATRIST"
            }
        ]
    },
    {
        "title": "Nutrition and Dietetics",
        "context": "\n\nWelcome to King Faisal Hospital Rwanda’s Nutrition and Dietetics Services. Our team of registered dietitians is dedicated to providing evidence-based nutrition care to our patients. We believe good nutrition is essential to overall health and well-being.\nOur Nutrition and Dietetics Services offer a range of services to meet the diverse needs of our patients. We provide assessment, diagnosis, and treatment for a wide range of conditions, including:\n\n Medical Nutrition Therapy: We provide individualized nutrition therapy for patients with chronic conditions, such as diabetes, heart disease, and kidney disease. Our registered dietitians work closely with the healthcare team to develop personalized nutrition plans that help manage symptoms and improve overall health.\nWeight Management: We offer weight management services for patients struggling with weight loss or weight gain. Our registered dietitians provide personalized nutrition plans, behavior modification strategies, and support to help patients achieve their weight management goals.\nSports Nutrition: We provide nutrition counseling for athletes and physically active individuals to help optimize performance and improve recovery. Our registered dietitians work with patients to develop nutrition plans that meet the specific needs of their sport or activity level.\nPediatric Nutrition: We provide nutrition counseling for infants, children, and adolescents to help support growth and development. Our registered dietitians work closely with parents and caregivers to develop nutrition plans that meet the unique needs of each child.\n\nOur Nutrition and Dietetics Services are an essential part of our healthcare team, and we are proud to offer a range of services to meet the diverse needs of our patients. If you would like to learn more about our Nutrition and Dietetics Services or schedule an appointment, please get in touch with us today. We look forward to serving you and your family.\n\n",
        "doctors": [
            {
                "name": "Mr. Rene Tabaro KARINIJABO",
                "title": "NUTRITIONIST & DIETITIAN"
            },
            {
                "name": "Mrs. Batetiwabo ESTHER",
                "title": "NUTRITIONIST"
            }
        ]
    },
    {
        "title": "Occupational & Physiotherapy",
        "context": "\n\nWelcome to KFHR’s Occupational Therapy (OT) services. Our highly skilled and experienced occupational therapists are committed to providing comprehensive care to our patients. Our goal is to help our patients achieve their maximum potential in daily activities and live their lives to the fullest.\nOur OT services are tailored to meet the unique needs of each patient. We work with patients with injuries, illnesses, or disabilities to help them regain their ability to perform daily activities such as dressing, grooming, and cooking. We also assist with adaptive equipment and modifications to help patients lead independent lives.\nOur team of occupational therapists has a wealth of knowledge and experience in a variety of areas, including:\n\nStroke Rehabilitation: We provide customized rehabilitation plans to help patients recover from stroke-related disabilities and regain their independence.\nMusculoskeletal Injuries: Our therapists provide expert care for patients with bone, joint, and muscle injuries. We use various techniques, including exercise prescription, manual therapy, and electrotherapy, to help patients recover from their injuries and manage their pain.\nPediatrics: We work with children with developmental delays or disabilities to help them develop the skills they need to live happy, healthy lives. We use play-based interventions to engage children and make therapy an enjoyable experience.\nMental Health: We work with patients with mental health concerns to help them improve their daily functioning and manage their symptoms. Our therapists use evidence-based approaches to address the unique needs of each patient.\nHand Therapy: We provide expert care for patients with hand injuries or conditions. We use specialized techniques and equipment to help patients regain strength, flexibility, and hand function.\n\nWe are committed to providing our patients with comprehensive, compassionate care. Our Occupational Therapy services are an essential part of our healthcare team, and we are proud to offer a range of services to meet the diverse needs of our patients.\nIf you would like to learn more about our OT services or schedule an appointment, please get in touch with us today. We look forward to serving you and your family.\n\n",
        "doctors": [
            {
                "name": "Mr. Yves MUHIRE",
                "title": "PHYSIOTHERAPIST"
            },
            {
                "name": "Mr. Eric MUTABAZI",
                "title": "SENIOR PHYSIOTHERAPIST"
            },
            {
                "name": "Mr. Jean Claude MUHIGIRWA",
                "title": "OCCUPATIONAL THERAPIST"
            },
            {
                "name": "Mr. Jean Apotre NIYIGABA",
                "title": "SENIOR PHYSIOTHERAPIST"
            }
        ]
    },
    {
        "title": "Speech and Language Therapy",
        "context": "\n\nWelcome to King Faisal Hospital Rwanda’s Speech and Language Therapy services. Our team of highly trained and experienced Speech-Language Pathologists (SLPs) is dedicated to providing comprehensive care to patients with communication and swallowing disorders. Our goal is to help our patients improve their communication skills and overall quality of life. Our speech therapist focuses on treating speech impairments in adults caused by brain injury, stroke, or other neurological disorders and speech disorders that develop during childhood in a supportive, nurturing environment.\nOur Speech and Language Therapy services are tailored to meet each patient’s unique needs. We provide assessment, diagnosis, and treatment for a wide range of conditions, including:\n\nSpeech Disorders: We work with patients who have difficulty with articulation, fluency, or voice production. Our\nLanguage Disorders: We provide therapy for patients with language disorders, such as aphasia, dyslexia, and developmental language disorders. Our SLPs use evidence-based techniques to help patients improve their comprehension, expression, and overall language skills.\nSwallowing Disorders: We work with patients who have difficulty swallowing, which can result in choking, aspiration, or malnutrition. Our SLPs use specialized techniques, such as neuromuscular electrical stimulation and swallowing exercises, to help patients improve their swallowing function.\n Cognitive-Communication Disorders: We provide therapy for patients with cognitive-communication disorders, such as traumatic brain injury or dementia. Our SLPs use techniques like memory and problem-solving exercises to help patients improve their cognitive function and communication skills.\n\nWe are committed to providing our patients with comprehensive, compassionate care at King Faisal Hospital Rwanda. Our Speech and Language Therapy services are an essential part of our healthcare team, and we are proud to offer a range of services to meet the diverse needs of our patients.\nIf you would like to learn more about our Speech and Language Therapy services or schedule an appointment, please get in touch with us today. We look forward to serving you and your family.\n\n",
        "doctors": [
            {
                "name": "Mr. Joseph TUMUSIIME",
                "title": "SPEECH & LANGUAGE THERAPIST"
            }
        ]
    }
]
